blog/2014/07/31/an-argument-for-parameter-validation/index.html
<!DOCTYPE html>
<html lang="en-us">
  <head>
  <title>An Argument for Parameter Validation - Katherine Cox-Buday</title>
  <meta charset="utf-8" />
  <meta http-equiv="X-UA-Compatible" content="IE=edge">
  <meta name="author" content="Katherine Cox-Buday" />

  <!-- Mobile support -->
  <meta name="viewport" content="width=device-width, initial-scale=1">

  <link rel="stylesheet" href="/media/css/main.css" type="text/css">
  <!-- <link rel="stylesheet" href="/media/css/prettify.css" type="text/css"> -->

  <!-- Latest compiled and minified CSS -->
  <link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.1/css/bootstrap.min.css">
  <!-- Optional theme -->
  <link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.1/css/bootstrap-theme.min.css">
  <!-- Latest compiled and minified JavaScript -->
  <link href="https://maxcdn.bootstrapcdn.com/font-awesome/4.2.0/css/font-awesome.min.css" rel="stylesheet">
</head>

  <body>
    <div class="container">
      <div class="row">
        <div class="col-sm-9 blog-main">
          <div class="post">
  <div class="col-sm-3 right-align post-meta">
    <h3>&nbsp;<!-- Placeholder for alignment with post --></h3>
  </div>
  <div class="col-sm-9">
    <div class="post">
      <h3>An Argument for Parameter Validation</h3>
      <p>
I'm a fan of validating parameters in languages which do not have preconditions.
</p>

<p>
First, let's define what I mean when I say validation.
</p>
<pre class="example">
Parameter validation is ensuring the things you utilize are in a state in which you can use them.
</pre>

<p>
Many people hear parameter validation and immediately jump to this:
</p>

<div class="org-src-container">
<pre class="src src-java">public void AnImportantMethod(report Report, author Author, repository Repository) {
    if(report == null)
      throw new NullPointerException("report");
    if(author == null)
      throw new NullPointerException("author");
    if(repository == null)
      throw new NullPointerException("repository");


    // Finally, our code!
    // ...
}
</pre>
</div>

<p>
Although checking for null values is a large responsibility of validating parameters, parameter validation isn't constrained to this. If you accept an integer, but want to make sure it falls within a range, that's parameter validation. If you want to ensure the object you're passed is in a known/correct state, that's parameter validation. If you want to make sure your business-object adheres to business rules that pertain to what you're going to do, that's parameter validation.
</p>

<p>
A code-base of any decent side will have disparate subsystems in various states of coupling. The way these systems interact can be subtle, and the data they share can have an infinite domain (strings, numbers), or at least be very complex (classes which break the law of demeter &#x2013; admit it, you have a few). Rather than try and reason about your entire code-base as a whole, I find it much easier to worry about the one thing my component is doing, and make sure it has everything it needs before getting started. So how do you go about this?
</p>

<p>
When reasoning about the correctness of your data, you have a few options:
</p>

<ol class="org-ol">
<li>Relying on the fact that the data was generated and transformed correctly everywhere else.</li>
<li>Defining coarse boundaries and validating data there (think user-input coming in).</li>
<li>Validating the data right before you use it.</li>
</ol>

<p>
Which should you choose?
</p>

<p>
Let's get a little philosophical. The ways in which the code boundary you are guarding are interacted with are discrete and finite at this moment in time. Let's call that number A. If you're lucky, perhaps A is some small number &#x2013; perhaps even 1 &#x2013; and you can reason about what data makes it across your code boundary.
</p>

<p>
But over time, A will change in ways you cannot predict (if you can, talk to me, and we'll make lots of money together). Architecture will change, the scope of your boundary might expand, the permutations that create your arguments might blow your data's domain out to some large number, code that didn't even exist might begin lobbing bytes across: you just don't know.
</p>

<p>
So perhaps it's because I'm paranoid, but I like to validate my inputs as close to their use as possible. The boundary I usually choose is methods. At the beginning of every method I do any validation I need to do to ensure that I at least started in a known state.
</p>

<p>
There are advantages and disadvantages to this technique.
</p>

<div id="outline-container-org118e2e8" class="outline-2">
<h2 id="org118e2e8">Advantages</h2>
<div class="outline-text-2" id="text-org118e2e8">
<ol class="org-ol">
<li><p>
<b>Adherence to the <a href="http://en.wikipedia.org/wiki/Fail-fast">Fail Fast principle</a>.</b>
</p>

<p>
Don't know why that's a good thing? Check out <a href="http://www.martinfowler.com/ieeeSoftware/failFast.pdf">this</a> great article.
</p></li>

<li><p>
<b>Complete Coverage</b>
</p>

<p>
No matter how your code is called, it will be validated.
</p></li>

<li><p>
<b>Code Contracts</b>
</p>

<p>
If I'm calling this code, what can I pass in? Are nulls OK? If I'm reading the code, this gives me an indication. If I'm calling the code, I know right away.
</p></li>
</ol>
</div>
</div>

<div id="outline-container-orgc6c5b28" class="outline-2">
<h2 id="orgc6c5b28">Disadvantages</h2>
<div class="outline-text-2" id="text-orgc6c5b28">
<ol class="org-ol">
<li><p>
<b>Performance</b>
</p>

<p>
If you call a guarded block of code repeatedly, validation can slow your program down demonstrably; however, this is an edge case and you shouldn't discard the entire concept of parameter validation at the altar of premature optimization.
</p></li>

<li><p>
<b>Verbosity</b>
</p>

<p>
It's extra lines of code &#x2013; no way around it &#x2013; however, given the potential benefit, this disadvantage seems insignificant. Further, there's ways to even further minimize this downside discussed below.
</p></li>

<li><p>
<b>Duplication of Effort</b>
</p>

<p>
This is the one I struggle with most. How many times are you going to check that an instance of a string is not empty before you believe it? There's some truth to this, but only in the simple case. As mentioned above, what string you are passed could change in the future; so in a sense we are guarding against the domain of values, not specific instances.
</p></li>
</ol>
</div>
</div>

<div id="outline-container-orge7e6567" class="outline-2">
<h2 id="orge7e6567">Smart Parameter Validation</h2>
<div class="outline-text-2" id="text-orge7e6567">
<p>
A long chain of if statements at the beginning of your code is cumbersome to write and maintain. It's prone to bugs, and it can actually hide incorrect parameters which are checked after other failing parameters. Do your parameter validation smarter:
</p>

<div class="org-src-container">
<pre class="src src-go">func PersistCreeps(dataStore io.Writer, creeps []*game.Creep) error {

    BeginValidation().Validate(
        IsNotNil(dataStore, "dataStore"),
        IsNotNil(creeps, "creeps"),
    ).CheckAndPanic().Validate(
        GreaterThan(len(creeps), 0, "creeps"),
    ).CheckAndPanic()

        // ...
}
</pre>
</div>

<p>
What the heck is that? It's a fluent style of parameter validation I picked up from the author of Paint.Net, Rick Brewster, in an <a href="http://blog.getpaint.net/2008/12/06/a-fluent-approach-to-c-parameter-validation/">article</a> he wrote. It chains together validation, and returns a single error containing all failures. You can also extend it to contain arbitrarily complex validators:
</p>

<div class="org-src-container">
<pre class="src src-go">func ReportFitsRepository(report *Report, repository *Repository) Checker {
    return func() (passes bool, err error) {

        err = fmt.Errorf("A %s report does not belong in a %s repository.", report.Type, repository.Type)
        passes = (repository.Type == report.Type)
        return passes, err
    }
}

func AuthorCanUpload(authorName string, repository *Repository) Checker {
    return func() (passes bool, err error) {
        err = fmt.Errorf("%s does not have access to this repository.", authorName)
        passes = !repository.AuthorCanUpload(authorName)
        return passes, err
    }
}

func AuthorIsCollaborator(authorName string, report *Report) Checker {
    return func() (passes bool, err error) {

        err = fmt.Errorf("The given author was not one of the collaborators for this report.")
        for _, collaboratorName := range report.Collaborators() {
            if collaboratorName == authorName {
                passes = true
                break
            }
        }
        return passes, err
    }
}

func HandleReport(authorName string, report *Report, repository *Repository) {

    BeginValidation().Validate(
        AuthorIsCollaborator(authorName, report),
        AuthorCanUpload(authorName, repository),
        ReportFitsRepository(report, repository),
    ).CheckAndPanic()
}
</pre>
</div>

<p>
Here we can see that parameter validation doesn't have to be verbose, or even hard to write. In fact, if done properly, parameter validation can bring a lot of clarity to your code, and give developers a sense of what you expect data to look like when passing your code boundary.
</p>

<p>
If you're interested in this style of parameter validation, and are working with Go, check out my validation library, <a href="https://github.com/kat-co/vala">Vala</a>.
</p>
</div>
</div>

    </div>
  </div>
</div> <!-- /.container -->

        </div> <!-- /.blog-main -->
        <div class="col-sm-3 blog-sidebar">
          <div class="sidebar-module sidebar-module-inset">
  <a href="/"><span class="fa fa-home fa-2x"></span></a>
  <a href="/rss.xml"><span class="fa fa-rss-square fa-2x"></span></a>
  <a href="/tags/"><span class="fa fa-tags fa-2x"></span></a>
</div>
<div class="sidebar-module">
  <form method="get" id="searchform" action="http://www.google.com/search">
    <input type="text" class="form-control" name="q" id="s" placeholder="Search">
    <input type="hidden" name="q" value="site:katherine.cox-buday.com">
  </form>
</div>
<div class="sidebar-module">
  <h4>Categories</h4>
  <ol class="list-unstyled">
    <li><a href="/blog/">Blog</a></li>
    <li><a href="/concurrency-in-go/">Concurrency in Go</a></li>
    <li><a href="/talks/">Talks</a></li>
    <!-- <li><a href="https://github.com/kelvinh/org-page">GitHub</a></li> -->
  </ol>
</div>
        </div> <!-- /.blog-sidebar -->
      </div> <!-- /.row -->
    </div> <!-- /.container -->
    <script src="//code.jquery.com/jquery-latest.min.js"></script>
<script src="//maxcdn.bootstrapcdn.com/bootstrap/3.3.1/js/bootstrap.min.js"></script>
<script src="https://google-code-prettify.googlecode.com/svn/loader/prettify.js"></script>
<script src="/media/js/main.js"></script>
<!-- HTML5 shim and Respond.js for IE8 support of HTML5 elements and media queries -->
<!--[if lt IE 9]>
    <script src="https://oss.maxcdn.com/html5shiv/3.7.2/html5shiv.min.js"></script>
    <script src="https://oss.maxcdn.com/respond/1.4.2/respond.min.js"></script>
<![endif]-->
<div class="container">
  <script type="text/javascript">
    $('.post-meta').append('<ul class="list-unstyled"><li><span title="post date" class="post-info">2014-07-31</span></li><li><span title="tags" class="post-info"><a href="/tags/tech/">tech</a></span></li></ul>');
  </script>
</div> <!-- /.container -->

<footer class="footer">
  <div class="container text-muted">
    <div class="row" style="heigh:2em;">
      <div class="col-md-2 vertical-center">
        <a href="https://github.com/kat-co"><span class="fa fa-github-square fa-2x"></span></a>
        <a href="http://www.linkedin.com/in/katherinecoxbuday"><span class="fa fa-linkedin-square fa-2x"></span></a>
        <a href="https://mstdn.social/@katco"><span class="fa fa-link fa-2x"></span></a>
      </div>
      <div class="col-sm-9 vertical-center">
        Copyright &copy; <a href="mailto:cox &lt;dot&gt; katherine &lt;dot&gt; e &lt;at&gt; gmail &lt;dot&gt; com">Katherine Cox-Buday</a>,
        Generated by <a href="http://www.gnu.org/software/emacs/">Emacs</a> 28.x (<a href="http://orgmode.org">Org mode</a> 9.x) & <a href="https://github.com/kelvinh/org-page" target="_blank">org-page</a>
      </div>
    </div> <!-- ./row -->
  </div> <!-- ./container -->
</footer>

  </body>
</html>
